---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryYTranslationSpring
source: html/7bc88659-000b-5067-d892-f62f5a835e9d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryYTranslationSpring Property

"Y Translation - Spring"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryYTranslationSpring { get; }
```